In [2]:
import pandas as pd

In [3]:
data=pd.read_csv("text.csv")

In [4]:
data

    name  age desin  salary
0   somu   21    ml  125554
1  sunny   22    ai    5655
2  monic   15   web    2555

In [5]:
data.shape

(3, 4)

In [6]:
data.dtypes

name      object
age        int64
desin     object
salary     int64
dtype: object

In [7]:
data.head(2)

    name  age desin  salary
0   somu   21    ml  125554
1  sunny   22    ai    5655

In [8]:
data.tail(1)

    name  age desin  salary
2  monic   15   web    2555

In [9]:
data.sample(n=2)

    name  age desin  salary
1  sunny   22    ai    5655
2  monic   15   web    2555

In [10]:
data.values

array([['somu', 21, 'ml', 125554],
       ['sunny', 22, 'ai', 5655],
       ['monic', 15, 'web', 2555]], dtype=object)

In [11]:
data.size # number os column and row

12

In [12]:
data.ndim # dimantion

2

In [13]:
data.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['name', 'age', 'desin', 'salary'], dtype='object')]

In [14]:
data.T

             0      1      2
name      somu  sunny  monic
age         21     22     15
desin       ml     ai    web
salary  125554   5655   2555

In [15]:
data.empty

False

In [16]:
pd.DataFrame().empty

True

In [17]:
# apply()

In [18]:
import numpy as np
np.random.randn(5,3)

array([[-1.61633237,  1.44147954, -0.02896994],
       [ 1.88542779, -0.01806639,  1.57371269],
       [-0.04682155, -1.71534664,  0.93576774],
       [-0.17292805, -2.98595866, -0.83179898],
       [ 0.03919776,  0.33664188,  0.99415742]])

In [19]:
data5=pd.DataFrame(np.random.randn(5,3),columns=["col1","col2","col3"])

In [20]:
data5

       col1      col2      col3
0 -1.748932 -0.658689 -0.255980
1 -2.284918  0.962147  0.150401
2 -0.255790 -0.512368  0.097587
3  0.905182 -1.775205 -0.077074
4  2.312536  1.948695 -0.786587

In [21]:
data5.apply(np.mean)

col1   -0.214384
col2   -0.007084
col3   -0.174331
dtype: float64

In [22]:
data5.apply(np.median)

col1   -0.255790
col2   -0.512368
col3   -0.077074
dtype: float64

In [23]:
data5.apply(lambda x: x.max())

col1    2.312536
col2    1.948695
col3    0.150401
dtype: float64

In [24]:
data5.apply(lambda x: x.min())

col1   -2.284918
col2   -1.775205
col3   -0.786587
dtype: float64

In [25]:
data5.apply(lambda x: x.max()-x.mean())

col1    2.526920
col2    1.955779
col3    0.324732
dtype: float64

In [26]:
data5["col1"].apply(lambda x: x+1)

0   -0.748932
1   -1.284918
2    0.744210
3    1.905182
4    3.312536
Name: col1, dtype: float64

In [27]:
data5

       col1      col2      col3
0 -1.748932 -0.658689 -0.255980
1 -2.284918  0.962147  0.150401
2 -0.255790 -0.512368  0.097587
3  0.905182 -1.775205 -0.077074
4  2.312536  1.948695 -0.786587

In [28]:
data5

       col1      col2      col3
0 -1.748932 -0.658689 -0.255980
1 -2.284918  0.962147  0.150401
2 -0.255790 -0.512368  0.097587
3  0.905182 -1.775205 -0.077074
4  2.312536  1.948695 -0.786587

In [30]:
# map(sequence, fun)

In [31]:
data5["col1"].map(lambda x: x*100)

0   -174.893221
1   -228.491805
2    -25.578987
3     90.518195
4    231.253586
Name: col1, dtype: float64

In [32]:
data5

       col1      col2      col3
0 -1.748932 -0.658689 -0.255980
1 -2.284918  0.962147  0.150401
2 -0.255790 -0.512368  0.097587
3  0.905182 -1.775205 -0.077074
4  2.312536  1.948695 -0.786587

In [35]:
data5.reindex(index=["a","b","c","d"])

   col1  col2  col3
a   NaN   NaN   NaN
b   NaN   NaN   NaN
c   NaN   NaN   NaN
d   NaN   NaN   NaN

In [36]:
data5

       col1      col2      col3
0 -1.748932 -0.658689 -0.255980
1 -2.284918  0.962147  0.150401
2 -0.255790 -0.512368  0.097587
3  0.905182 -1.775205 -0.077074
4  2.312536  1.948695 -0.786587

In [38]:
data5.rename(columns={"col1":"c1"})

         c1      col2      col3
0 -1.748932 -0.658689 -0.255980
1 -2.284918  0.962147  0.150401
2 -0.255790 -0.512368  0.097587
3  0.905182 -1.775205 -0.077074
4  2.312536  1.948695 -0.786587

In [39]:
data5.rename(columns={"col1":"c1"},index={0:"somu"})

            c1      col2      col3
somu -1.748932 -0.658689 -0.255980
1    -2.284918  0.962147  0.150401
2    -0.255790 -0.512368  0.097587
3     0.905182 -1.775205 -0.077074
4     2.312536  1.948695 -0.786587

In [43]:
for col,row in data5.iterrows():
    print(col,row)

0 col1   -1.748932
col2   -0.658689
col3   -0.255980
Name: 0, dtype: float64
1 col1   -2.284918
col2    0.962147
col3    0.150401
Name: 1, dtype: float64
2 col1   -0.255790
col2   -0.512368
col3    0.097587
Name: 2, dtype: float64
3 col1    0.905182
col2   -1.775205
col3   -0.077074
Name: 3, dtype: float64
4 col1    2.312536
col2    1.948695
col3   -0.786587
Name: 4, dtype: float64

In [44]:
for col in data5.itertuples():
    print(col)

Pandas(Index=0, col1=-1.7489322111766314, col2=-0.6586887794519666, col3=-0.2559802803429241)
Pandas(Index=1, col1=-2.284918049195729, col2=0.9621467107406275, col3=0.15040110235792162)
Pandas(Index=2, col1=-0.25578986871686155, col2=-0.5123677806095516, col3=0.09758675912356612)
Pandas(Index=3, col1=0.9051819507056946, col2=-1.7752053834317187, col3=-0.0770744476468112)
Pandas(Index=4, col1=2.312535856600573, col2=1.9486945777218128, col3=-0.7865870760515123)

In [45]:
# sort values 
sort_values()

NameError: name 'sort_values' is not defined

In [46]:
data5.sort_values(by=['col1'])

       col1      col2      col3
1 -2.284918  0.962147  0.150401
0 -1.748932 -0.658689 -0.255980
2 -0.255790 -0.512368  0.097587
3  0.905182 -1.775205 -0.077074
4  2.312536  1.948695 -0.786587